// Функція для перетворення числа в текст
function numberToText(number) {
    var units = ['', 'один', 'два', 'три', 'чотири', 'п\'ять', 'шість', 'сім', 'вісім', 'дев\'ять'];
    var teens = ['', 'одинадцять', 'дванадцять', 'тринадцять', 'чотирнадцять', 'п\'ятнадцять', 'шістнадцять', 'сімнадцять', 'вісімнадцять', 'дев\'ятнадцять'];
    var tens = ['', 'десять', 'двадцять', 'тридцять', 'сорок', 'п\'ятдесят', 'шістдесят', 'сімдесят', 'вісімдесят', 'дев\'яносто'];
    var hundreds = ['', 'сто', 'двісті', 'триста', 'чотириста', 'п\'ятсот', 'шістсот', 'сімсот', 'вісімсот', 'дев\'ятсот'];

    // Числа=Текст
    if (number == 0) {
        return 'Нуль';
    } else if (number < 10) {
        return units[number];
    } else if (number < 20) {
        return teens[number - 10];
    } else if (number < 100) {
        return tens[Math.floor(number / 10)] + ' ' + units[number % 10];
    } else if (number < 1000) {
        return hundreds[Math.floor(number / 100)] + ' ' + tens[Math.floor((number % 100) / 10)] + ' ' + units[number % 10];
    } else {
        return 'Число перевищує 1000';
    }
}

// Отримуємо введене числове значення з клавіатури
var inputValue = prompt("Введіть число:");

// Перевіряємо, чи введено число
if (!isNaN(inputValue)) {
    // Перетворюємо введене значення у число
    var number = parseInt(inputValue);
    
    // Перевіряємо, чи число не перевищує 1000
    if (number <= 1000) {
        // Перетворюємо число у текст та виводимо на екран
        alert("Ви ввели вартість: " + numberToText(number));
    } else {
        // Виводимо повідомлення про помилку
        alert("Ви ввели занадто велике значення. Максимальне число - 1000.");
    }
} else {
    // Виводимо повідомлення про помилку
    alert("Будь ласка, введіть числове значення.");
}
